backend/app/controllers/api/v1/households_controller.rb

SELECT SUM("households"."amount_planned") FROM "households" WHERE "households"."user_id" = $1  [["user_id", 943]]
---
  def index_total
    all_amount_planned = current_api_v1_user.households.sum(:amount_planned)