backend/app/controllers/api/v1/households_controller.rb

SELECT "households".* FROM "households" WHERE "households"."user_id" = ?  [["user_id", 1]]
---
  def index
    households = @user.households.all

INSERT INTO "households" ("user_id", "name", "amount_planned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1419], ["name", "test"], ["amount_planned", 10000], ["created_at", "2022-05-26 01:34:53.999614"], ["updated_at", "2022-05-26 01:34:53.999614"]]
---
  def create
    household = @user.households.new(household_params)
    if household.save

DELETE FROM "households" WHERE "households"."id" = $1  [["id", 258]]
---
  def destroy
    if @household.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user_params
    @user = User.find(params[:user_id])

SELECT "households".* FROM "households" WHERE "households"."user_id" = ? AND "households"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_household
    @household = @user.households.find(params[:id])