backend/app/controllers/api/v1/spendings_controller.rb

SELECT "spendings".* FROM "spendings" WHERE "spendings"."household_id" = $1 ORDER BY "spendings"."used_at" ASC  [["household_id", 271]]
---
  def index
    spendings = @household.spendings.order(used_at: :asc).all

INSERT INTO "spendings" ("household_id", "used_at", "amount_used", "memo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["household_id", 339], ["used_at", "2022-05-01"], ["amount_used", 500], ["memo", "test1"], ["created_at", "2022-05-26 01:41:07.339426"], ["updated_at", "2022-05-26 01:41:07.339426"]]
---
  def create
    spending = @household.spendings.new(spending_params)
    if spending.save

DELETE FROM "spendings" WHERE "spendings"."id" = $1  [["id", 55]]
---
  def destroy
    if @spending.destroy!

SELECT "households".* FROM "households" WHERE "households"."user_id" = $1 AND "households"."id" = $2 LIMIT $3  [["user_id", 1496], ["id", 354], ["LIMIT", 1]]
---
  def set_household
    @household = current_api_v1_user.households.find(params[:household_id])

SELECT "spendings".* FROM "spendings" WHERE "spendings"."household_id" = $1 AND "spendings"."id" = $2 LIMIT $3  [["household_id", 354], ["id", 69], ["LIMIT", 1]]
---
  def set_spending
    @spending = @household.spendings.find(params[:id])